
## Terraform plan for environment: `int`

**Commit:** e239b8e799cf1d73e40b87ee665cb6a37db3e2e6


**API version:** dbb4aa3bdb
**CLI version:** dbb4aa3bdb
**Selfserve version:** 9a7cb0edb6
**Internal version:** 9a7cb0edb6
**search version:** release-v5.14.1

### Plan summary

`2 to add, 46 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.aws_cloudwatch_dashboard.services
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "5189946077001264137" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "46809e72e4" -> "dbb4aa3bdb"
          ~ "deployed_cli_image_tag"       = "46809e72e4" -> "dbb4aa3bdb"
            # (3 unchanged elements hidden)
        }
    }

  # module.service.aws_cloudwatch_dashboard.services will be created
  + resource "aws_cloudwatch_dashboard" "services" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 5
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + {
                                      + expression = "mm1m2 * 100 / mm0m2"
                                      + id         = "expr1m2"
                                      + label      = "vol-app-int-internal-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm1m3 * 100 / mm0m3"
                                      + id         = "expr1m3"
                                      + label      = "vol-app-int-api-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm1m6 * 100 / mm0m6"
                                      + id         = "expr1m6"
                                      + label      = "vol-app-int-selfserve-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "CpuReserved",
                                  + "ClusterName",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm0m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm0m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm0m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + ".",
                                  + "CpuUtilized",
                                  + ".",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm1m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm1m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm1m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                            ]
                          + period   = 300
                          + region   = "eu-west-1"
                          + stacked  = false
                          + stat     = "Sum"
                          + timezone = "UTC"
                          + title    = "CPU Utilization"
                          + view     = "timeSeries"
                          + yAxis    = {
                              + left = {
                                  + label     = "Percent"
                                  + min       = 0
                                  + showUnits = false
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + {
                                      + expression = "mm1m2 * 100 / mm0m2"
                                      + id         = "expr1m2"
                                      + label      = "vol-app-int-internal-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm1m3 * 100 / mm0m3"
                                      + id         = "expr1m3"
                                      + label      = "vol-app-int-api-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm1m6 * 100 / mm0m6"
                                      + id         = "expr1m6"
                                      + label      = "vol-app-int-selfserve-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "MemoryReserved",
                                  + "ClusterName",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm0m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm0m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm0m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilized",
                                  + ".",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm1m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm1m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm1m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                            ]
                          + period   = 300
                          + region   = "eu-west-1"
                          + stacked  = false
                          + stat     = "Sum"
                          + timezone = "UTC"
                          + title    = "Memory Utilization"
                          + view     = "timeSeries"
                          + yAxis    = {
                              + left = {
                                  + label     = "Percent"
                                  + min       = 0
                                  + showUnits = false
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 8
                      + y          = 0
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + {
                                      + expression = "mm1m2 * 100 / mm0m2"
                                      + id         = "expr1m2"
                                      + label      = "vol-app-int-internal-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm1m3 * 100 / mm0m3"
                                      + id         = "expr1m3"
                                      + label      = "vol-app-int-api-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm1m6 * 100 / mm0m6"
                                      + id         = "expr1m6"
                                      + label      = "vol-app-int-selfserve-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "EphemeralStorageReserved",
                                  + "ClusterName",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm0m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm0m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm0m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + ".",
                                  + "EphemeralStorageUtilized",
                                  + ".",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm1m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm1m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm1m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                            ]
                          + period   = 300
                          + region   = "eu-west-1"
                          + stacked  = false
                          + stat     = "Sum"
                          + timezone = "UTC"
                          + title    = "Disk Utilization"
                          + view     = "timeSeries"
                          + yAxis    = {
                              + left = {
                                  + label     = "Percent"
                                  + min       = 0
                                  + showUnits = false
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 16
                      + y          = 0
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + {
                                      + expression = "mm0m2 + mm1m2"
                                      + id         = "expr1m2"
                                      + label      = "vol-app-int-internal-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm0m3 + mm1m3"
                                      + id         = "expr1m3"
                                      + label      = "vol-app-int-api-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm0m6 + mm1m6"
                                      + id         = "expr1m6"
                                      + label      = "vol-app-int-selfserve-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "NetworkRxBytes",
                                  + "ClusterName",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm0m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm0m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm0m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + ".",
                                  + "NetworkTxBytes",
                                  + ".",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm1m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm1m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm1m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                            ]
                          + period   = 300
                          + region   = "eu-west-1"
                          + stacked  = false
                          + stat     = "Average"
                          + timezone = "UTC"
                          + title    = "Network"
                          + view     = "timeSeries"
                          + yAxis    = {
                              + left = {
                                  + label     = "Bytes/Second"
                                  + showUnits = false
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 0
                      + y          = 5
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + {
                                      + expression = "mm0m2"
                                      + id         = "expr1m2"
                                      + label      = "vol-app-int-internal-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm0m3"
                                      + id         = "expr1m3"
                                      + label      = "vol-app-int-api-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm0m6"
                                      + id         = "expr1m6"
                                      + label      = "vol-app-int-selfserve-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "TaskCount",
                                  + "ClusterName",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm0m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm0m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm0m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                            ]
                          + period   = 300
                          + region   = "eu-west-1"
                          + stacked  = false
                          + stat     = "Average"
                          + timezone = "UTC"
                          + title    = "Task Count"
                          + view     = "timeSeries"
                          + yAxis    = {
                              + left = {
                                  + label     = "Count"
                                  + showUnits = false
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 8
                      + y          = 5
                    },
                  + {
                      + height     = 5
                      + properties = {
                          + legend   = {
                              + position = "right"
                            }
                          + liveData = false
                          + metrics  = [
                              + [
                                  + {
                                      + expression = "mm0m2"
                                      + id         = "expr1m2"
                                      + label      = "vol-app-int-internal-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm0m3"
                                      + id         = "expr1m3"
                                      + label      = "vol-app-int-api-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "mm0m6"
                                      + id         = "expr1m6"
                                      + label      = "vol-app-int-selfserve-cluster"
                                      + region     = "eu-west-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "ServiceCount",
                                  + "ClusterName",
                                  + "vol-app-int-internal-cluster",
                                  + {
                                      + id      = "mm0m2"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-api-cluster",
                                  + {
                                      + id      = "mm0m3"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + "...",
                                  + "vol-app-int-selfserve-cluster",
                                  + {
                                      + id      = "mm0m6"
                                      + region  = "eu-west-1"
                                      + visible = false
                                    },
                                ],
                            ]
                          + period   = 300
                          + region   = "eu-west-1"
                          + stacked  = false
                          + stat     = "Average"
                          + timezone = "UTC"
                          + title    = "Service Count"
                          + view     = "timeSeries"
                          + yAxis    = {
                              + left = {
                                  + label     = "Count"
                                  + showUnits = false
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 8
                      + x          = 16
                      + y          = 5
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "ActiveConnectionCount",
                                  + "LoadBalancer",
                                  + "/app/b21df94bee7afbcc/079795fb21af88e7",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "079795fb21af88e7 - ActiveConnectionCount"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 10
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "ActiveConnectionCount",
                                  + "LoadBalancer",
                                  + "/app/5d7b89e0d93d5b1e/4c6cdab6c475f605",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "4c6cdab6c475f605 - ActiveConnectionCount"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 10
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "ActiveConnectionCount",
                                  + "LoadBalancer",
                                  + "/app/becaba98d0276fd3/b92208df7025b367",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "b92208df7025b367 - ActiveConnectionCount"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 10
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_4XX_Count",
                                  + "LoadBalancer",
                                  + "/app/b21df94bee7afbcc/079795fb21af88e7",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "079795fb21af88e7 - HTTPCode_ELB_4XX_Count"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 16
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_4XX_Count",
                                  + "LoadBalancer",
                                  + "/app/5d7b89e0d93d5b1e/4c6cdab6c475f605",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "4c6cdab6c475f605 - HTTPCode_ELB_4XX_Count"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 16
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_4XX_Count",
                                  + "LoadBalancer",
                                  + "/app/becaba98d0276fd3/b92208df7025b367",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "b92208df7025b367 - HTTPCode_ELB_4XX_Count"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 16
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_5XX_Count",
                                  + "LoadBalancer",
                                  + "/app/b21df94bee7afbcc/079795fb21af88e7",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "079795fb21af88e7 - HTTPCode_ELB_5XX_Count"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 16
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_5XX_Count",
                                  + "LoadBalancer",
                                  + "/app/5d7b89e0d93d5b1e/4c6cdab6c475f605",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "4c6cdab6c475f605 - HTTPCode_ELB_5XX_Count"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 16
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_5XX_Count",
                                  + "LoadBalancer",
                                  + "/app/becaba98d0276fd3/b92208df7025b367",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "b92208df7025b367 - HTTPCode_ELB_5XX_Count"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 16
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "RequestCount",
                                  + "LoadBalancer",
                                  + "/app/b21df94bee7afbcc/079795fb21af88e7",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "079795fb21af88e7 - RequestCount"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 10
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "RequestCount",
                                  + "LoadBalancer",
                                  + "/app/5d7b89e0d93d5b1e/4c6cdab6c475f605",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "4c6cdab6c475f605 - RequestCount"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 10
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/ApplicationELB",
                                  + "RequestCount",
                                  + "LoadBalancer",
                                  + "/app/becaba98d0276fd3/b92208df7025b367",
                                ],
                            ]
                          + region  = "eu-west-1"
                          + stacked = false
                          + title   = "b92208df7025b367 - RequestCount"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 10
                    },
                ]
            }
        )
      + dashboard_name = "vol-app-int"
      + id             = (known after apply)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:81"
        name                       = "vol-app-int-cancel-unsubmitted-bilateral"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:81"
        name                       = "vol-app-int-ch-vs-olcs-diffs"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:81"
        name                       = "vol-app-int-clean-up-variations"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:81"
        name                       = "vol-app-int-close-expired-windows"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:81"
        name                       = "vol-app-int-cns"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:81"
        name                       = "vol-app-int-company-profile-dlq"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:81"
        name                       = "vol-app-int-create-psv-licence-surrender-task"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:81"
        name                       = "vol-app-int-data-retention-delete"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:81"
        name                       = "vol-app-int-data-retention-populate"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:81"
        name                       = "vol-app-int-data-retention-postcheck"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:81"
        name                       = "vol-app-int-data-retention-precheck"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:81"
        name                       = "vol-app-int-database-maintenance"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:81"
        name                       = "vol-app-int-digital-continuation-reminders"
      ~ revision                   = 81 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:81" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "46809e72e4" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "dbb4aa3bdb"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:46809e72e4" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:dbb4aa3bdb"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
     ... (truncated, see full plan in the workflow run logs)
```

</details>